saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.S32K118_SDK_DFP.1.0.0.pdsc
    <condition id="S32K DRV_LPTMR">
      <description>NXP S32K Driver LPTMR dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K DRV_LPUART">
      <description>NXP S32K Driver LPUART IRQ dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="eDMA"/>
      <require Cclass="Device" Cgroup="SDK OSIF"   Csub="OSIF"/>
    </condition>
    <condition id="S32K DRV_MPU">
      <description>NXP S32K Driver MPU dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_PDB">
      <description>NXP S32K Driver PDB dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
    </condition>
    <condition id="S32K DRV_PINS">
      <description>NXP S32K Driver PINS dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_Power">
      <description>NXP S32K System Power dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_RTC">
      <description>NXP S32K Driver RTC dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>
    <condition id="S32K DRV_TRGMUX">
      <description>NXP S32K Driver TRGMUX dependency</description>
      <require condition="S32K"/>
    </condition>
    <condition id="S32K DRV_WDOG">
      <description>NXP S32K Driver WDOG dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

    <condition id="S32K PAL_SPI">
      <description>NXP S32K PAL SPI dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPSPI"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (SPI)"/>
    </condition>
    <condition id="S32K PAL_UART">
      <description>NXP S32K PAL UART dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="FlexIO (UART)"/>
    </condition>


    <condition id="S32K OSIF_BM">
      <description>NXP S32K OSIF Bare Metal dependency</description>
      <require condition="S32K"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Clock"/>
      <require Cclass="Device" Cgroup="SDK Driver" Csub="Interrupt"/>
    </condition>

  </conditions>

  <taxonomy>
    <description Cclass="Device" Cgroup="SDK HAL">S32 SDK Hardware Abstraction Layer (HAL)</description>
    <description Cclass="Device" Cgroup="SDK Driver">S32 SDK Peripheral Drivers</description>
  </taxonomy>

  <apis>
    <api Cclass="Device" Cgroup="SDK API"               exclusive="1">
      <description>S32 SDK API</description>
      <files>
        <file category="doc" name="doc/S32SDK_S32K118_Documentation.pdf"/>
      </files>
    </api>
    <api Cclass="Device" Cgroup="SDK Quick Start Guide" exclusive="1">
      <description>S32 SDK Quick Start Guide</description>
      <files>
        <file category="doc" name="doc/S32SDKQSG.pdf"/>
      </files>
    </api>
  </apis>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="S32K118_CMSIS">
      <description>System Startup for NXP S32K Series</description>
      <RTE_Components_h>
        <!-- the following content goes into file 'RTE_Components.h' -->
        #define RTE_DEVICE_STARTUP_S32K      /* Device Startup for S32K Series */
      </RTE_Components_h>
      <files>
        <!-- include folders -->
        <file category="header"  name="platform/devices/device_registers.h"/> <!-- generates warning in PackCheck because name is not CMSIS conform -->
        <file category="include" name="platform/devices/"/>
        <file category="include" name="platform/devices/common/"/>

        <!-- startup files -->
        <file category="source" name="platform/devices/startup.c"/>

        <file category="sourceAsm" name="platform/devices/S32K118/startup/armc/startup_S32K118.s"            attr="config" version="1.0.0" condition="AC5"/>
        <file category="sourceAsm" name="platform/devices/S32K118/startup/armc/startup_S32K118.s"            attr="config" version="1.0.0" condition="AC6"/>
        <file category="sourceC"   name="platform/devices/S32K118/startup/gcc/startup_S32K118.S"             attr="config" version="1.0.0" condition="GCC"/>
        <file category="sourceAsm" name="platform/devices/S32K118/startup/iar/startup_S32K118.s"             attr="config" version="1.0.0" condition="IAR"/>

        <!-- system files -->
        <file category="header" name="platform/devices/S32K118/startup/system_S32K118.h"                   attr="config" version="1.0.0"/>
        <file category="source" name="platform/devices/S32K118/startup/system_S32K118.c"                   attr="config" version="1.0.0"/>

        <!-- linker scripts -->  <!-- RAM linker scripts have the category "other": Files are copied but not treated automatically as linker scripts -->
        <file category="linkerScript" name="platform/devices/S32K118/linker/armc/S32K118_25_flash_AC5.sct" attr="config" version="1.0.0" condition="AC5"/>
        <file category="linkerScript" name="platform/devices/S32K118/linker/armc/S32K118_25_ram_AC5.sct"   attr="config" version="1.0.0" condition="AC5"/>

        <file category="linkerScript" name="platform/devices/S32K118/linker/armc/S32K118_25_flash.sct"     attr="config" version="1.0.0" condition="AC6"/>
        <file category="linkerScript" name="platform/devices/S32K118/linker/armc/S32K118_25_ram.sct"       attr="config" version="1.0.0" condition="AC6"/>

        <file category="linkerScript" name="platform/devices/S32K118/linker/gcc/S32K118_25_flash.ld"       attr="config" version="1.0.0" condition="GCC"/>
        <file category="linkerScript" name="platform/devices/S32K118/linker/gcc/S32K118_25_ram.ld"         attr="config" version="1.0.0" condition="GCC"/>

        <file category="linkerScript" name="platform/devices/S32K118/linker/iar/S32K118_25_flash.icf"      attr="config" version="1.0.0" condition="IAR"/>
        <file category="linkerScript" name="platform/devices/S32K118/linker/iar/S32K118_25_ram.icf"        attr="config" version="1.0.0" condition="IAR"/>
     </files>
    </component>

