saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.S32K118_SDK_DFP.1.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPIT"          Cversion="1.0.0" condition="S32K DRV_LPIT">
      <description>LPIT Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPIT
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lpit__drv.html"/>
        <file category="header" name="platform/drivers/inc/lpit_driver.h"/>
        <file category="source" name="platform/drivers/src/lpit/lpit_driver.c"/>
        <!--file category="source" name="platform/drivers/src/lpit/lpit_hw_access.c"/-->
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPSPI"         Cversion="1.0.0" condition="S32K DRV_LPSPI">
      <description>LPSPI Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPSPI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lpspi__driver.html"/>
        <file category="header" name="platform/drivers/inc/lpspi_master_driver.h"/>
        <file category="header" name="platform/drivers/inc/lpspi_slave_driver.h"/>
        <file category="header" name="platform/drivers/inc/lpspi_shared_function.h"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_master_driver.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_slave_driver.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_shared_function.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_irq.c"/>
        <file category="source" name="platform/drivers/src/lpspi/lpspi_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPTMR"         Cversion="1.0.0" condition="S32K DRV_LPTMR">
      <description>LPTMR Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPTMR
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lptmr__driver.html"/>
        <file category="header" name="platform/drivers/inc/lptmr_driver.h"/>
        <file category="source" name="platform/drivers/src/lptmr/lptmr_driver.c"/>
        <file category="source" name="platform/drivers/src/lptmr/lptmr_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="LPUART"        Cversion="1.0.0" condition="S32K DRV_LPUART">
      <description>LPUART Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_LPUART
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__lpuart__driver.html"/>
        <file category="header" name="platform/drivers/inc/lpuart_driver.h"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_driver.c"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_hw_access.c"/>
        <file category="source" name="platform/drivers/src/lpuart/lpuart_irq.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="MPU"           Cversion="1.0.0" condition="S32K DRV_MPU">
      <description>MPU Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_MPU
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__mpu__drv.html"/>
        <file category="header" name="platform/drivers/inc/mpu_driver.h"/>
        <file category="source" name="platform/drivers/src/mpu/mpu_driver.c"/>
        <file category="source" name="platform/drivers/src/mpu/mpu_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="PDB"           Cversion="1.0.0" condition="S32K DRV_PDB">
      <description>PDB Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PDB
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__pdb__driver.html"/>
        <file category="header" name="platform/drivers/inc/pdb_driver.h"/>
        <file category="source" name="platform/drivers/src/pdb/pdb_driver.c"/>
        <file category="source" name="platform/drivers/src/pdb/pdb_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="PINS"          Cversion="1.0.0" condition="S32K DRV_PINS">
      <description>PINS Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_PINS
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__pins__driver.html"/>
        <file category="header" name="platform/drivers/inc/pins_driver.h"/>
        <file category="source" name="platform/drivers/src/pins/pins_driver.c"/>
        <file category="source" name="platform/drivers/src/pins/pins_port_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="Power"         Cversion="1.0.0" condition="S32K DRV_Power">
      <description>Power Manager (SK32K1xx)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_POWER
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__power__manager.html"/>
        <file category="header" name="platform/drivers/inc/power_manager.h"/>
        <file category="source" name="platform/drivers/src/power/power_manager.c"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_manager_S32K1xx.c"/>
        <file category="header" name="platform/drivers/src/power/S32K1xx/power_manager_S32K1xx.h"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_pmc_hw_access.c"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_rcm_hw_access.c"/>
        <file category="source" name="platform/drivers/src/power/S32K1xx/power_smc_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="RTC"           Cversion="1.0.0" condition="S32K DRV_RTC">
      <description>Real Time Clock Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_RTC
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__rtc__driver.html"/>
        <file category="header" name="platform/drivers/inc/rtc_driver.h"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_driver.c"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_hw_access.c"/>
        <file category="source" name="platform/drivers/src/rtc/rtc_irq.c"/>
      </files>
    </component>
