saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/Keil.S32K118_SDK_DFP.1.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Driver" Csub="TRGMUX"        Cversion="1.0.0" condition="S32K DRV_TRGMUX">
      <description>TRGMUX Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_SAI
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__trgmux__driver.html"/>
        <file category="header" name="platform/drivers/inc/trgmux_driver.h"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_driver.c"/>
        <file category="source" name="platform/drivers/src/trgmux/trgmux_hw_access.c"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Driver" Csub="WDOG"          Cversion="1.0.0" condition="S32K DRV_WDOG">
      <description>WDOG Driver</description>
      <RTE_Components_h>
        #define RTE_DEVICE_DRIVER_WDOG
      </RTE_Components_h>
      <files>
         <file category="doc"    name="doc/html/group__wdog__drv.html"/>
        <file category="header" name="platform/drivers/inc/wdog_driver.h"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_driver.c"/>
        <file category="source" name="platform/drivers/src/wdog/wdog_hw_access.c"/>
      </files>
    </component>

    <!-- SDK OSA -->
    <component Cclass="Device" Cgroup="SDK OSIF" Csub="OSIF" Cvariant="Bare Metal" Cversion="1.0.0" condition="S32K OSIF_BM">
      <description>Bare Metal Abstraction Layer (no RTOS)</description>
      <RTE_Components_h>
        #define RTE_DEVICE_OSIF_BM
      </RTE_Components_h>
      <files>
        <file category="doc"    name="doc/html/group__osif.html"/>
        <file category="header" name="rtos/osif/osif.h"/>
        <file category="source" name="rtos/osif/osif_baremetal.c"/>
      </files>
    </component>

    <bundle Cbundle="S32K118-EVB" Cclass="Board Support" Cversion="1.0.0">
      <description>NXP S32K118-EVB Development Board</description>
      <doc></doc>
      <component Cgroup="LED"           Capiversion="1.0.0" condition="S32K118 DRV_CLOCK_PINS">
        <description>LED Interface for S32K118-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K118-EVB/Common/LED_S32K118-EVB.c"/>
        </files>
      </component>
      <component Cgroup="Buttons"       Capiversion="1.0.0" condition="S32K118 DRV_CLOCK_PINS">
        <description>Buttons Interface for S32K118-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K118-EVB/Common/Buttons_S32K118-EVB.c"/>
        </files>
      </component>
      <!--component Cgroup="A/D Converter" Capiversion="1.0.0" condition="S32K118 DRV_CLOCK_PINS_ADC">
        <description>A/D Converter Interface for S32K118-EVB</description>
        <files>
          <file category="source" name="addon_mdk/Boards/NXP/S32K118-EVB/Common/ADC_S32K118-EVB.c"/>
        </files>
      </component-->
    </bundle>

  </components>

  <boards>
    <board name="S32K118-EVB" vendor="NXP" revision="Rev. B" salesContact="http://www.nxp.com/support/sales-and-support:SUPPORTHOME">
      <mountedDevice    deviceIndex="0" Dvendor="NXP:11" Dname="FS32K118xxxxMLHx"/>
      <compatibleDevice deviceIndex="0" Dvendor="NXP:11" Dname="S32K118*"/>
      <description>
        The S32K118-EVB is a development board for the S32K118 32-bit ARM® Cortex™-M0+ MCUs.
      </description>
    </board>

  </boards>

  <examples>
    <!-- S32K118-EVB FRDM Board -->
    <example name="CMSIS-RTOS2 (Keil RTX5) Blinky" doc="Abstract.txt" folder="addon_mdk/Boards/NXP/S32K118-EVB/RTOS2_KeilRTX5_Blinky/">
      <description>CMSIS-RTOS2 (Keil RTX5) based Blinky example</description>
      <board name="S32K118-EVB" vendor="NXP" Dvendor="NXP:11"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>CMSIS-RTX</category>
      </attributes>
    </example>

  </examples>

</package>
